FAMILY_NAMES = 
{
 "鹤田", "麻生", "小田切", "渡边", "稻垣", "木村", "中居", "濑户", "山下", "酒井", "松本", "石田", "柴崎", "藤原", "福山", "江口", "唐泽", "长泽", "椎名", "松岛", "白石", "铃木", "织田", "泷泽", "药师丸", "菅野", "澹台", "石黑", "丰川", "平宫", "拓跋", "工藤", "赤西", "松山", "高岛", "井之原", "竹野内", "广末", "石垣", "小松", "滨崎", "滨田", "山本", "原田", "永山", "栗山", "冈部", "忍成", "寺岛", "黑木",
 "伊势谷", "野口", "北乃", "绫濑", "荣仓", "加藤", "宫崎", "风间", "户田", "山口", "井川", "深田", "米仓", "佐藤", "小池", "上野", "伊东", "须藤", "长濑", "倍赏", "岸谷", "赤坂", "中村", "相叶", "今井", "黑川", "伊藤", "五十岚", "野际", "岛谷", "堤", "加濑", "吉田", "观月", "深津", "洼冢", "吹石", "吉冈", "阿部", "吉泽", "松田", "长谷川", "国仲", "上川", "北村", "宝生", "宗政", "佐藤", "铃木", "高桥",
 "田中", "渡辺", "伊藤", "中村", "小林", "吉田", "井上", "斎藤", "木村", "清水", "山崎", "森", "池田", "桥本", "山下", "石川", "中岛", "前田", "藤田", "小川", "冈田", "后藤", "村上", "近藤", "石井", "坂本", "青木", "藤井", "西村", "福田", "太田", "藤原", "三浦", "冈本", "松田", "中川", "中野", "原田", "小野", "竹内", "金子", "和田", "中山", "石田", "上田", "原", "柴田", "酒井", "横山", "高木",
 "安藤", "谷口", "大野", "丸山", "今井", "高田", "河野", "藤本", "小岛", "村田", "武田", "上野", "杉山", "増田","宫本","佐佐木","源", "菅原", "平野", "小山", "大冢", "千叶", "久保", "岩崎", "木下", "松尾", "野口", "野村", "菊地", "佐野", "大西", "麻仓", "波多野","樱庭", "土肥原","道明寺",}

MALE1_NAMES = 
{
 "重麻吕", "新之助", "智久", "安吾", "晴明", "邦彦", "和也", "疏石", "绍瑾", "慧鹤", "信长", "润二", "芭蕉", "漱石", "光晴", "千秋", "久作", "清张", "夏彦", "夏生", "一树", "和志", "院静", "子规", "雪信", "玉溪", "北斋", "伴水", "魁夷", "经惟", "光昭", "纪信", "博司", "理", "博雅", "道风", "夕夏", "住明", "良松", "晨茂", "千古", "定基", "望城", "在雅", "雅行", "在明", "祥光", "为逸", "万寿藏", "十兵卫",
 "小次郎", "武藏", "义经", "抱月", "暮鸟", "犀星", "心平", "白秋", "一碧楼", "敦盛", "妹子", "马子", "利休", "政宗", "如水", "龙马", "梅太郎", "公望", "一辉", "博文", "道雪", "上二", "秀一", "上二", "智子", "龙井", "秀中", "隆一", "清志", "和彦", "秀幸", "英助", "胜平", "高志", "克寿", "拓也", "尘八", "鹰", "一郎", "蓝生", "爱辉", "碧泉", "蓝哉", "信玄", "相洋", "苍辉", "青太", "阿尾斗", "碧羽", "葵真",
 "明志", "爽生", "明瀬", "晶世", "晟", "秋成", "彰久", "昭充", "彬光", "秋岭", "明峰", "安树梦", "明快", "秋芳", "朝史", "浅斗", "安佐人", "麻阳", "朝飞", "麻哉", "朝矢", "浅洋", "安枝斗", "明日空", "阿须久", "亜辅", "吾介", "安栖诚", "阿津都", "阿苏", "温太", "中", "笃朱", "厚斗", "温辉", "温久", "集真", "热诚", "厚之", "温良", "亜塔", "按南", "有仁", "在诚", "安吾", "晏人", "威吾", "意织", "衣绪斗", "伊贺",
 "三太郎", "郁人", "育之助", "生鼓斗", "伊佐树", "有为也", "宇一", "岩登", "岩太", "磐城", "伊利辉", "伊武希", "翔太", "陆", "飒太", "大辉", "悠斗", "健太", "隼人", "大地", "大辅", "骏", "亮太", "太一", "航", "健", "直树", "太郎", "拓真",}

FEMALE1_NAMES = 
{
 "真纪", "美沙", "结衣", "优子", "咲", "空", "翔子", "里奈", "纪子", "里代", "千春", "智沙", "直子", "友美", "七恵", "希", "梨香", "工美", "葵", "琴美", "未央", "佐和子", "贵子", "裕子", "美恵子", "峰子", "真子", "奈绪美", "顺子", "加穂里", "淳子", "瞳", "芽衣", "奈未", "沙树", "由贵", "明美", "恵利香", "加奈子", "留美", "优子", "典予", "恵津子", "一子", "弥代", "麻里", "芳子", "纪香", "恭子", "晴美",
 "絵里", "一恵", "有美子", "晶", "纱菜", "理沙", "理恵子", "恵", "舞", "朱里", "麻矢", "未来", "千晶", "史奈", "志乃", "映莉子", "奈美", "茜", "桃子", "直美", "美纪", "美贵", "芳美", "羽月", "玲亜", "朋美", "菜穂子", "亚莉莎", "光", "兰", "庆", "华英", "结花", "夕纪", "五月", "真弓", "清夏", "花衣", "晶子", "千鹤", "律子", "晴美", "都记子", "智子", "里穂", "丽矢", "美纪", "尚子", "熏", "美和",
 "毬絵", "城源寺", "洋子", "文子", "川浜", "麻衣子", "千里", "范子", "雏妃", "和津美", "芳子", "彩水", "万理江", "沙也果", "佳乃", "唯", "绫乃", "绢香", "令子", "雪乃", "仁见", "亜弥", "飞香", "可奈子", "玲子", "佐智子", "千春", "春奈", "込山", "比吕", "明日香", "裕子", "珠琴", "千明", "千加", "美礼", "黒沢", "香织", "麻耶", "南", "纯", "萌", "由树", "知重", "奈奈", "菜菜子", "丽子", "季実子", "沙良", "彩",
 "美铃", "圣子", "真澄", "寿梨", "真树", "早记", "杏里", "纯菜", "千里", "遥歩", "绫佳", "蓝子", "流奈", "美智代", "英里", "英子", "一美", "裕子", "沙恵", "南国", "西田", "美穂乃", "早纪", "菜摘", "末子", "芙由子", "允保", "真珠", "茧子", "容子", "叶",}

